anonymous-commands-in-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1b899ab">Introduction</a>
<ul>
<li><a href="#orge5b06bc">add-hook</a></li>
</ul>
</li>
<li><a href="#org5a76402">Solution</a>
<ul>
<li><a href="#orgd9b1893">defun</a></li>
</ul>
</li>
<li><a href="#org69d86a0">Result</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1b899ab" class="outline-2">
<h2 id="org1b899ab">Introduction</h2>
<div class="outline-text-2" id="text-org1b899ab">
<p>
Generally, you do not want to make keybindings to anonymous lambdas.
Here is the primary reason that comes to mind:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(describe-keymap
 (<span style="font-weight: bold;">let</span> ((m (make-sparse-keymap)))
   (define-key m (kbd <span style="font-style: italic;">"f"</span>) (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>) 'hi))
   m))
</pre>
</div>

<p>
I get help buffer with this content:
</p>

<pre class="example" id="org03d0888">
Key             Binding
f		[closure]
</pre>

<p>
It is not really useful to just get the info [closure] here.
</p>
</div>

<div id="outline-container-orge5b06bc" class="outline-3">
<h3 id="orge5b06bc">add-hook</h3>
<div class="outline-text-3" id="text-orge5b06bc">
<p>
The same thing goes for <code>add-hook</code>. From the doc string:
</p>

<blockquote>
<p>
FUNCTION may be any valid function, but it's recommended to use a
function symbol and not a lambda form.  Using a symbol will
ensure that the function is not re-added if the function is
edited, and using lambda forms may also have a negative
performance impact when running `add-hook' and `remove-hook'
</p>
</blockquote>

<p>
Some of the hooks functionality is meant for symbols.
</p>
</div>
</div>
</div>


<div id="outline-container-org5a76402" class="outline-2">
<h2 id="org5a76402">Solution</h2>
<div class="outline-text-2" id="text-org5a76402">
<p>
Alias your function:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defalias</span> '<span style="font-weight: bold;">foo-a</span> (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>) 'hi))
 (describe-keymap
  (<span style="font-weight: bold;">let</span> ((m (make-sparse-keymap)))
    (define-key m (kbd <span style="font-style: italic;">"f"</span>) 'foo-a)
    (define-key m (kbd <span style="font-style: italic;">"b"</span>) (<span style="font-weight: bold;">defalias</span> '<span style="font-weight: bold;">foo-b</span> (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">interactive</span>) 'hi2)))
   m))
</pre>
</div>

<pre class="example" id="org859408a">
Key             Binding
b		foo-b
f		foo-a
</pre>


<p>
Foo-b works because <code>defalias</code> returns the symbol.
</p>
</div>

<div id="outline-container-orgd9b1893" class="outline-3">
<h3 id="orgd9b1893">defun</h3>
<div class="outline-text-3" id="text-orgd9b1893">
<p>
<code>(defalias 'foo (lambda () (interactive)))</code>
</p>

<p>
is essentially the same as
</p>

<p>
<code>(defun foo () (interactive))</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org69d86a0" class="outline-2">
<h2 id="org69d86a0">Result</h2>
<div class="outline-text-2" id="text-org69d86a0">
<p>
I end up just using  <code>defun</code> inline.
Examples:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-hook
 'sh-mode-hook
 (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">mm/add-bash-completion</span> () ...))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(mememacs/leader-def
  <span style="font-style: italic;">"pP"</span> (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">mm/project-switch-project-find-file</span> ()
         (<span style="font-weight: bold;">interactive</span>) ...))
</pre>
</div>

<p>
After writing this post, <a href="https://github.com/benjamin-asdf/dotfiles/commit/1e4135b977a5866de19020ba6f8a92b417339157">I went and fixed the remaining add-hook lambas</a> In my config.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.0.50 (<a href="https://orgmode.org">Org</a> mode 9.5.4)</p>
</div>
</body>
</html>
